Terraform plan in __terraform__
<details>
  <summary>Plan: 12 to add, 0 to change, 5 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.gmail_initWatch_function is tainted, so must be replaced
-/+ resource "google_cloudfunctions_function" "gmail_initWatch_function" {
      - environment_variables = {} -> null
      ~ https_trigger_url     = "https://europe-west1-lilaobot.cloudfunctions.net/gmail-initWatch" -> (known after apply)
      ~ id                    = "******************************************************************" -> (known after apply)
      - labels                = {} -> null
        name                  = "gmail-initWatch"
      ~ project               = "lilaobot" -> (known after apply)
      ~ region                = "europe-west1" -> (known after apply)
      ~ service_account_email = "lilaobot@appspot.gserviceaccount.com" -> (known after apply)
      ~ source_archive_object = "gmail_notifier_function_content.zip" -> "gmail_notifier_function_content.zip#533365b3b92005caf4720216ebe12d13"
        # (8 unchanged attributes hidden)

      + event_trigger {
          + event_type = (known after apply)
          + resource   = (known after apply)

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_cloudfunctions_function.gmail_onNewMessage_function is tainted, so must be replaced
-/+ resource "google_cloudfunctions_function" "gmail_onNewMessage_function" {
      - environment_variables = {} -> null
      + https_trigger_url     = (known after apply)
      ~ id                    = "******************************************************************************" -> (known after apply)
      - labels                = {} -> null
        name                  = "gmail-onNewMessage-receiver"
      ~ project               = "lilaobot" -> (known after apply)
      ~ region                = "europe-west1" -> (known after apply)
      ~ service_account_email = "lilaobot@appspot.gserviceaccount.com" -> (known after apply)
      ~ source_archive_object = "gmail_notifier_function_content.zip" -> "gmail_notifier_function_content.zip#533365b3b92005caf4720216ebe12d13"
        # (7 unchanged attributes hidden)

      ~ event_trigger {
            # (2 unchanged attributes hidden)

          ~ failure_policy {
              ~ retry = false -> (known after apply)
            }
        }
    }

  # google_cloudfunctions_function.oauth2_callback_function is tainted, so must be replaced
-/+ resource "google_cloudfunctions_function" "oauth2_callback_function" {
      - environment_variables = {} -> null
      ~ https_trigger_url     = "https://europe-west1-lilaobot.cloudfunctions.net/oauth2-callback" -> (known after apply)
      ~ id                    = "******************************************************************" -> (known after apply)
      - labels                = {} -> null
        name                  = "oauth2-callback"
      ~ project               = "lilaobot" -> (known after apply)
      ~ region                = "europe-west1" -> (known after apply)
      ~ service_account_email = "lilaobot@appspot.gserviceaccount.com" -> (known after apply)
      ~ source_archive_object = "gmail_notifier_function_content.zip" -> "gmail_notifier_function_content.zip#533365b3b92005caf4720216ebe12d13"
        # (8 unchanged attributes hidden)

      + event_trigger {
          + event_type = (known after apply)
          + resource   = (known after apply)

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_cloudfunctions_function.oauth2_init_function is tainted, so must be replaced
-/+ resource "google_cloudfunctions_function" "oauth2_init_function" {
      - environment_variables = {} -> null
      ~ https_trigger_url     = "https://europe-west1-lilaobot.cloudfunctions.net/oauth2-init" -> (known after apply)
      ~ id                    = "**************************************************************" -> (known after apply)
      - labels                = {} -> null
        name                  = "oauth2-init"
      ~ project               = "lilaobot" -> (known after apply)
      ~ region                = "europe-west1" -> (known after apply)
      ~ service_account_email = "lilaobot@appspot.gserviceaccount.com" -> (known after apply)
      ~ source_archive_object = "gmail_notifier_function_content.zip" -> "gmail_notifier_function_content.zip#533365b3b92005caf4720216ebe12d13"
        # (8 unchanged attributes hidden)

      + event_trigger {
          + event_type = (known after apply)
          + resource   = (known after apply)

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_cloudfunctions_function.slack_publisher_function will be created
  + resource "google_cloudfunctions_function" "slack_publisher_function" {
      + available_memory_mb   = 128
      + description           = "Receives messages from Pub/sub and send them to Slack"
      + entry_point           = "publishToSlack"
      + https_trigger_url     = (known after apply)
      + id                    = (known after apply)
      + max_instances         = 0
      + name                  = "slack-publisher"
      + project               = (known after apply)
      + region                = (known after apply)
      + runtime               = "python39"
      + service_account_email = (known after apply)
      + source_archive_bucket = "lilaobot-functions-storage"
      + source_archive_object = "slack_publisher_function_content.zip#dcfe09f0e51d03cbde6b1b90b17f1e51"
      + timeout               = 60

      + event_trigger {
          + event_type = "providers/cloud.pubsub/eventTypes/topic.publish"
          + resource   = "projects/lilaobot/topics/calls_for_offer"

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_cloudfunctions_function_iam_member.gmail_initWatch_invoker will be created
  + resource "google_cloudfunctions_function_iam_member" "gmail_initWatch_invoker" {
      + cloud_function = "gmail-initWatch"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # google_cloudfunctions_function_iam_member.gmail_onNewMessage_invoker will be created
  + resource "google_cloudfunctions_function_iam_member" "gmail_onNewMessage_invoker" {
      + cloud_function = "gmail-onNewMessage-receiver"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # google_cloudfunctions_function_iam_member.oauth2_callback_invoker will be created
  + resource "google_cloudfunctions_function_iam_member" "oauth2_callback_invoker" {
      + cloud_function = "oauth2-callback"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # google_cloudfunctions_function_iam_member.oauth2_init_invoker will be created
  + resource "google_cloudfunctions_function_iam_member" "oauth2_init_invoker" {
      + cloud_function = "oauth2-init"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # google_cloudfunctions_function_iam_member.slack_publisher_invoker will be created
  + resource "google_cloudfunctions_function_iam_member" "slack_publisher_invoker" {
      + cloud_function = "slack-publisher"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # google_pubsub_topic.slack_callForOffer_topic will be created
  + resource "google_pubsub_topic" "slack_callForOffer_topic" {
      + id      = (known after apply)
      + name    = "calls_for_offer"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }
    }

  # google_storage_bucket_object.gmail_notifier_archive must be replaced
-/+ resource "google_storage_bucket_object" "gmail_notifier_archive" {
      ~ content_type   = "application/zip" -> (known after apply)
      ~ crc32c         = "/8LuUA==" -> (known after apply)
      ~ detect_md5hash = "3P4J8OUdA8veaxuQsX8eUQ==" -> "different hash" # forces replacement
      ~ id             = "***********************************************************************************************" -> (known after apply)
      ~ md5hash        = "3P4J8OUdA8veaxuQsX8eUQ==" -> (known after apply)
      ~ name           = "gmail_notifier_function_content.zip#bab45c6add65702b3abb5e756b0ecb13" -> "gmail_notifier_function_content.zip#533365b3b92005caf4720216ebe12d13" # forces replacement
      ~ output_name    = "gmail_notifier_function_content.zip#bab45c6add65702b3abb5e756b0ecb13" -> (known after apply)
      ~ self_link      = "https://www.googleapis.com/storage/v1/b/lilaobot-functions-storage/o/gmail_notifier_function_content.zip%23bab45c6add65702b3abb5e756b0ecb13" -> (known after apply)
      ~ source         = "slack_publisher_function_content.zip" -> "gmail_notifier_function_content.zip" # forces replacement
      ~ storage_class  = "STANDARD" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 12 to add, 0 to change, 5 to destroy.
```
</details>

Plan generated in [Create terraform plan #14](https://github.com/Zenika/lilaobot/actions/runs/1004965654)